recept/src/InformationRegisters/ЦеныМатериалов/ЦеныМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныМатериалов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

recept/src/InformationRegisters/СтатусПродукции/СтатусПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусПродукции</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыГотовностиПродукции</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

recept/src/InformationRegisters/ЦенаПокупки/ЦенаПокупки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦенаПокупки</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Наиенование</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

recept/src/AccumulationRegisters/ОстаткиМатериалов/ОстаткиМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиМатериалов</name>
  <resources>
    <name>Остаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Наименование</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

recept/src/AccumulationRegisters/ВПроизводстве/ВПроизводстве.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВПроизводстве</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Наименование</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПроизводства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

recept/src/AccumulationRegisters/Продано/Продано.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продано</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

recept/src/Enums/ВозрастКлиента/ВозрастКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВозрастКлиента</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>Старый</name>
  </enumValues>
</mdclass:Enum>

recept/src/Enums/СтытусОбеспеченияЗаказа/СтытусОбеспеченияЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтытусОбеспеченияЗаказа</name>
  <enumValues>
    <name>Заявка</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
</mdclass:Enum>

recept/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Продукция</name>
  </enumValues>
  <enumValues>
    <name>Сырье</name>
  </enumValues>
  <enumValues>
    <name>УслугаРазделитель</name>
  </enumValues>
</mdclass:Enum>

recept/src/Enums/ЕдиницыИзмерения/ЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЕдиницыИзмерения</name>
  <enumValues>
    <name>Литр</name>
  </enumValues>
  <enumValues>
    <name>Килограмм</name>
  </enumValues>
  <enumValues>
    <name>Штука</name>
  </enumValues>
  <enumValues>
    <name>услуга</name>
  </enumValues>
</mdclass:Enum>

recept/src/CommonModules/РаботаСоСправочниками/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТекущуюДатуСеанса() Экспорт
	Возврат ТекущаяДатаСеанса();
КонецФункции

#КонецОбласти

Функция ЦенаМатериалов (АктуальнаяДата, ЭлементНоменклатуры) Экспорт
	
	Отбор =  Новый Структура ("Номенклатура", ЭлементНоменклатуры);
	ЗначениеРесурсов = РегистрыСведений.ЦеныМатериалов.ПолучитьПоследнее(АктуальнаяДата, Отбор);
	Возврат ЗначениеРесурсов.Цена;    
	
КонецФункции 

Функция СтатусМатериала (ЭлементНоменклатуры) Экспорт
	
	Отбор =  Новый Структура ("Номенклатура", ЭлементНоменклатуры);
	ЗначениеРесурсов = РегистрыСведений.СтатусПродукции.ПолучитьПоследнее(ТекущаяДата(), Отбор);
	Возврат ЗначениеРесурсов.Статус;    
	
КонецФункции       

Функция ЦенаПокупки (ЭлементНоменклатуры) Экспорт
	
	Отбор =  Новый Структура ("Наиенование", ЭлементНоменклатуры);
	ЗначениеРесурсов = РегистрыСведений.ЦенаПокупки.ПолучитьПоследнее(ТекущаяДата(), Отбор);
	Возврат ЗначениеРесурсов.Цена;    
	
КонецФункции  

Функция ОстаткиМатериалов (ЭлементНоменклатуры) Экспорт
	
	ОстатокНаСкладе = 0;
	
	Отбор =  Новый Структура ("Наименование", ЭлементНоменклатуры);
	ЗначениеРесурсов = РегистрыНакопления.ОстаткиМатериалов.Остатки(ТекущаяДата() , Отбор);
	
	Если ЗначениеРесурсов.Количество() > 0 Тогда 
		ОстатокНаСкладе = ЗначениеРесурсов[0].Остаток;     
	КонецЕсли; 
	
	Возврат ОстатокНаСкладе;
	
КонецФункции     

Функция ВПроизводствеОстаток (Ссылка, Наименование) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВПроизводствеОбороты.КоличествоОборот КАК КоличествоОборот
		|ИЗ
		|	РегистрНакопления.ВПроизводстве.Обороты(, , Регистратор, ) КАК ВПроизводствеОбороты
		|ГДЕ
		|	ВПроизводствеОбороты.Наименование = &Наименование
		|	И ВПроизводствеОбороты.Регистратор.ДокументОснование.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Сумма = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сумма = Сумма + ВыборкаДетальныеЗаписи.КоличествоОборот; 
	КонецЦикла;
	Возврат Сумма;
	
КонецФункции      

Функция Продано (Ссылка, Наименование) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроданоОбороты.КоличествоОборот КАК КоличествоОборот
		|ИЗ
		|	РегистрНакопления.Продано.Обороты(, , Регистратор, ) КАК ПроданоОбороты
		|ГДЕ
		|	ПроданоОбороты.Регистратор.ДокументОснование.Ссылка = &Ссылка
		|	И ПроданоОбороты.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Наименование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();   
	
	Сумма = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сумма = Сумма + ВыборкаДетальныеЗаписи.КоличествоОборот; 
	КонецЦикла;  
	Возврат Сумма;

КонецФункции

Функция ВыпускПродукции(Ссылка, Наименование) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиМатериаловОбороты.ОстатокОборот КАК Количество
		|ИЗ
		|	РегистрНакопления.ОстаткиМатериалов.Обороты(, , Регистратор, ) КАК ОстаткиМатериаловОбороты
		|ГДЕ
		|	ОстаткиМатериаловОбороты.Наименование = &Наименование
		|	И ОстаткиМатериаловОбороты.Регистратор.ДокументОснование.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Сумма = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сумма = Сумма + ВыборкаДетальныеЗаписи.Количество; 
	КонецЦикла;
	Возврат Сумма;

КонецФункции

Функция ВозрастКлиента(Контрагент, Дата) Экспорт 
	
	ТекстЗапроса1 =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДокументПродажи.Дата КАК ПерваяПродажа
		|ИЗ
		|	Документ.ДокументПродажи КАК ДокументПродажи
		|ГДЕ
		|	ДокументПродажи.Контрагент = &Контрагент 
		|   И ДокументПродажи.ПометкаУдаления = ЛОЖЬ
		|	И НАЧАЛОПЕРИОДА(ДокументПродажи.Дата, ДЕНЬ) МЕЖДУ ДОБАВИТЬКДАТЕ(&Дата, ГОД, -1) И &Дата
		|УПОРЯДОЧИТЬ ПО 
		|	ПерваяПродажа ВОЗР";  
  
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.Текст = ТекстЗапроса1;
	РезультатЗапроса1 = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи1 = РезультатЗапроса1.Выбрать();
	ВыборкаДетальныеЗаписи1.Следующий();
	ПерваяПродажаЗаГод = ВыборкаДетальныеЗаписи1.ПерваяПродажа;
	
	ТекстЗапроса2 = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДокументПродажи.Дата КАК ПоследняяПродажа
		|ИЗ
		|	Документ.ДокументПродажи КАК ДокументПродажи
		|ГДЕ
		|	ДокументПродажи.Контрагент = &Контрагент
		|   И ДокументПродажи.ПометкаУдаления = ЛОЖЬ
		|	И НАЧАЛОПЕРИОДА(ДокументПродажи.Дата, ДЕНЬ) МЕЖДУ ДОБАВИТЬКДАТЕ(&Дата, ГОД, -2) И ДОБАВИТЬКДАТЕ(&Дата, ГОД, -1)
		|УПОРЯДОЧИТЬ ПО 
		|	ПоследняяПродажа УБЫВ";
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.Текст = ТекстЗапроса2;
	РезультатЗапроса2 = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи2 = РезультатЗапроса2.Выбрать();
	ВыборкаДетальныеЗаписи2.Следующий();
	ПоследняяПродажаПрошлыйГод = ВыборкаДетальныеЗаписи2.ПоследняяПродажа;
	
	Возраст = ПредопределенноеЗначение("Перечисление.ВозрастКлиента.Новый");
	
	Если НЕ ПерваяПродажаЗаГод = Неопределено Тогда
		Если НЕ ПоследняяПродажаПрошлыйГод = Неопределено Тогда 
			Дельта = ПерваяПродажаЗаГод - ПоследняяПродажаПрошлыйГод;
			Если Дельта < 31536000 Тогда Возраст = ПредопределенноеЗначение("Перечисление.ВозрастКлиента.Старый");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;		
	
	Возврат Возраст;
		
КонецФункции

Функция СоздатьДокументРеализации(ДокБП, Резерв) Экспорт 
	
    ДокПрод 						= Документы.РасходнаяНакладная.СоздатьДокумент();
	ДокПрод.Номер 					= ДокБП.Номер;
	ДокПрод.Дата 					= ДокБП.Дата;
	ДокПрод.Контрагент 				= НайтиКонтрагента(ДокБП.Контрагент);
	ДокПрод.Ответственный			= НайтиОтветственного(ДокБП.Ответственный);
	
	Если Не Резерв Тогда 
		ДокПрод.СтатусОбеспеченияЗаказа	= Перечисления.СтытусОбеспеченияЗаказа.Заявка;
		Для Каждого СтрокаТЗ Из ДокБП.Товары Цикл
	    	НоваяСтрокаТаблицыТовары 				= ДокПрод.Товары.Добавить();
			НоваяСтрокаТаблицыТовары.Количество		= СтрокаТЗ.Количество;
			НоваяСтрокаТаблицыТовары.ЦенаПродажи	= СтрокаТЗ.Цена;
			НоваяСтрокаТаблицыТовары.Сумма			= СтрокаТЗ.Количество * СтрокаТЗ.Цена;
			НоваяСтрокаТаблицыТовары.Номенклатура	= СоздатьНоменклатуру(СтрокаТЗ.Номенклатура);
		КонецЦикла;
	Иначе
		ДокПрод.СтатусОбеспеченияЗаказа	= Перечисления.СтытусОбеспеченияЗаказа.ВРаботе;
	КонецЕсли;
	ДокПрод.Записать(РежимЗаписиДокумента.Запись);
	
	Возврат ДокПрод.Ссылка;
	
КонецФункции

Функция НайтиКонтрагента(Контрагент);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Покупатели.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Покупатели КАК Покупатели
		|ГДЕ
		|	Покупатели.Код = &ИНН";
	
	Запрос.УстановитьПараметр("ИНН", Контрагент.ИНН);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе 
		конт 				= Справочники.Покупатели.СоздатьЭлемент();
		конт.Наименование 	= Контрагент.Наименование;
		конт.Код			= Контрагент.ИНН;
		конт.Примечание		= "Создан при загрузке из БП";
		конт.Записать();
		Возврат конт.Ссылка;
	КонецЕсли;
	
КонецФункции

Функция НайтиОтветственного(Пользователь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Пользователь.Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе 
		Ползун 				= Справочники.Пользователи.СоздатьЭлемент();
		Ползун.Наименование = Пользователь.Наименование;
		Ползун.Записать();
		Возврат Ползун.Ссылка;
	КонецЕсли;
	
КонецФункции 

Функция СоздатьНоменклатуру(Номенклатура);
	Товар						= Справочники.НоменклатураМатериалы.СоздатьЭлемент();
	Товар.Наименование 			= Номенклатура.Наименование;
	Товар.ТипНоменклатуры 		= Перечисления.ТипыНоменклатуры.Продукция;
	Товар.ЕдиницаИзмеренияСырья = Перечисления.ЕдиницыИзмерения.Килограмм;
	Товар.Примечание			= "*";
	Товар.Записать();
	Возврат Товар.Ссылка	
КонецФункции
